In [1]:
import pandas as pd

In [2]:
data={'name':['Alice','Bob','Charlie'],'age':[5,6,3]}

In [3]:
df=pd.DataFrame(data)

In [4]:
df['gender']='Male'

In [5]:
df.head()

      name  age gender
0    Alice    5   Male
1      Bob    6   Male
2  Charlie    3   Male

In [6]:
import numpy as np

In [7]:
df.loc[3]=['Hero',np.nan,'Male']

In [8]:
df.head()

      name  age gender
0    Alice  5.0   Male
1      Bob  6.0   Male
2  Charlie  3.0   Male
3     Hero  NaN   Male

In [9]:
df.isna()

    name    age  gender
0  False  False   False
1  False  False   False
2  False  False   False
3  False   True   False

In [10]:
df.loc[0,'gender']=np.nan

In [11]:
df.head()

      name  age gender
0    Alice  5.0    NaN
1      Bob  6.0   Male
2  Charlie  3.0   Male
3     Hero  NaN   Male

# Handling nan data 
Method: fillna and drop na

In [12]:
df['age'].fillna(26)

0     5.0
1     6.0
2     3.0
3    26.0
Name: age, dtype: float64

In [13]:
df.head()

      name  age gender
0    Alice  5.0    NaN
1      Bob  6.0   Male
2  Charlie  3.0   Male
3     Hero  NaN   Male

In [14]:
df['age'].fillna(6,inplace=True)

In [15]:
df.head()

      name  age gender
0    Alice  5.0    NaN
1      Bob  6.0   Male
2  Charlie  3.0   Male
3     Hero  6.0   Male

In [16]:
df.gender.fillna('Female',inplace=True)

In [17]:
df.head()

      name  age  gender
0    Alice  5.0  Female
1      Bob  6.0    Male
2  Charlie  3.0    Male
3     Hero  6.0    Male

In [18]:
df.loc[1,'gender']=np.nan

In [19]:
df.head()

      name  age  gender
0    Alice  5.0  Female
1      Bob  6.0     NaN
2  Charlie  3.0    Male
3     Hero  6.0    Male

In [20]:
df.dropna()

      name  age  gender
0    Alice  5.0  Female
2  Charlie  3.0    Male
3     Hero  6.0    Male

In [21]:
df.head()

      name  age  gender
0    Alice  5.0  Female
1      Bob  6.0     NaN
2  Charlie  3.0    Male
3     Hero  6.0    Male

In [22]:
df.dropna(inplace=True)

In [23]:
df.head()

      name  age  gender
0    Alice  5.0  Female
2  Charlie  3.0    Male
3     Hero  6.0    Male

In [24]:
df.drop('gender',axis=1)

      name  age
0    Alice  5.0
2  Charlie  3.0
3     Hero  6.0

In [25]:
df.head()

      name  age  gender
0    Alice  5.0  Female
2  Charlie  3.0    Male
3     Hero  6.0    Male

In [26]:
df.drop(3,axis=0)

      name  age  gender
0    Alice  5.0  Female
2  Charlie  3.0    Male

In [27]:
df.head()

      name  age  gender
0    Alice  5.0  Female
2  Charlie  3.0    Male
3     Hero  6.0    Male

In [28]:
df.reset_index()

   index     name  age  gender
0      0    Alice  5.0  Female
1      2  Charlie  3.0    Male
2      3     Hero  6.0    Male

In [29]:
df.reset_index().drop('index',axis=1)

      name  age  gender
0    Alice  5.0  Female
1  Charlie  3.0    Male
2     Hero  6.0    Male

In [30]:
df.head()

      name  age  gender
0    Alice  5.0  Female
2  Charlie  3.0    Male
3     Hero  6.0    Male

In [31]:
df.reset_index(drop=True,inplace=True)

In [32]:
df.head()

      name  age  gender
0    Alice  5.0  Female
1  Charlie  3.0    Male
2     Hero  6.0    Male

In [33]:
df.columns

Index(['name', 'age', 'gender'], dtype='object')

# reseting column name

In [34]:
col_maper={'name': 'nam', 'age':'umer'}

In [35]:
df.rename(columns=col_maper)

       nam  umer  gender
0    Alice   5.0  Female
1  Charlie   3.0    Male
2     Hero   6.0    Male

In [36]:
df.head()

      name  age  gender
0    Alice  5.0  Female
1  Charlie  3.0    Male
2     Hero  6.0    Male

# applying function

In [37]:
def double(x):
    return x*2

In [38]:
df['age'].apply(double)

0    10.0
1     6.0
2    12.0
Name: age, dtype: float64

# Grouped

In [39]:
df.head()

      name  age  gender
0    Alice  5.0  Female
1  Charlie  3.0    Male
2     Hero  6.0    Male

In [40]:
group=df.groupby('gender')

In [41]:
group

# Aggregate

In [42]:
group.agg({"age":"mean"})

        age
gender
Female  5.0
Male    4.5

# Calculus

In [43]:
# 1. 
# 2. Differentiation and Integration

In [44]:
#!pip install sympy

In [45]:
import sympy as sp

In [46]:
x=sp.symbols('x')
f=(x**2 - 1)/(x-1)
limit=sp.limit(f,x,1)
limit

2

# Derivative

In [47]:
x=sp.symbols('x')
f=sp.sin(x)
dfdx=sp.diff(f,x)
dfdx

cos(x)

In [48]:
# Assignment

In [113]:
import pandas as pd
data={'name':['ram','hari','sita','gita','shyam','rita','ganesh'],'score':[90,56,78,67,87,63,50],'class':['sun','sun','moon','sun','moon','moon','moon']}
df=pd.DataFrame(data)
groupinbuilt=df.groupby('class').agg({'score':'mean'})

def highest(x):
    return x.nlargest().iloc[0]

groupinbuilt2=df.groupby('class').agg({'score':'nlargest'})
groupmade=df.groupby('class').agg({'score':highest})
print(groupinbuilt)
print(groupinbuilt2)
print(groupmade)

       score
class
moon    69.5
sun     71.0
         score
class
moon  4     87
      2     78
      5     63
      6     50
sun   0     90
      3     67
      1     56
       score
class
moon      87
sun       90

In [76]:
df.head()

    name  score class
0    ram     90   sun
1   hari     56   sun
2   sita     78  moon
3   gita     67   sun
4  shyam     87  moon

In [77]:
df.agg({'score':['sum','min']})

     score
sum    491
min     50

In [79]:
df.score.agg(lambda num: num + 2)

0    92
1    58
2    80
3    69
4    89
5    65
6    52
Name: score, dtype: int64